Autodesk.Revit.DB.InternalDefinition.FormatStringOfDouble(Autodesk.Revit.DB.Document,System.Double,Autodesk.Revit.DB.FormatOptions)
Formats a double value to a string.
document:
The document of this parameter.
value:
The double value to format.
option:
The format for the conversion.
Returns:
The formatted value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.InternalDefinition.ScanStringOfDouble(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.FormatOptions,System.Double@,System.String@)
Converts a formated string to a double value, or give an error message.
document:
The document of this parameter.
str:
The string to convert.
option:
The format for the conversion.
value:
The converted double value if conversion succeeds.
pMessage:
Localized validation error message if conversion fails.
Returns:
True if conversion succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.InternalDefinition.GetParamDef(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the parameter definition of the parameter Id.
cda:
The document.
paramId:
The parameter id.
Returns:
The name of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null